load-test/results/stress-chaos/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/k6-script.js
        output: json (/Users/laratidesco/Documents/trabalho_sistemas_distribuidos/load-test/results/stress-chaos/k6-metrics.json)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 4m30s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 4m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
constant_load   [   0% ] 5 VUs  0m01.0s/4m0s

running (0m02.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
constant_load   [   1% ] 5 VUs  0m02.0s/4m0s

running (0m03.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
constant_load   [   1% ] 5 VUs  0m03.0s/4m0s

running (0m04.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m04.0s/4m0s

running (0m05.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m05.0s/4m0s

running (0m06.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m06.0s/4m0s

running (0m07.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m07.0s/4m0s

running (0m08.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m08.0s/4m0s

running (0m09.0s), 5/5 VUs, 81 complete and 0 interrupted iterations
constant_load   [   4% ] 5 VUs  0m09.0s/4m0s

running (0m10.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
constant_load   [   4% ] 5 VUs  0m10.0s/4m0s

running (0m11.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m11.0s/4m0s

running (0m12.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m12.0s/4m0s

running (0m13.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m13.0s/4m0s

running (0m14.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
constant_load   [   6% ] 5 VUs  0m14.0s/4m0s

running (0m15.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
constant_load   [   6% ] 5 VUs  0m15.0s/4m0s

running (0m16.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m16.0s/4m0s

running (0m17.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m17.0s/4m0s

running (0m18.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m18.0s/4m0s

running (0m19.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m19.0s/4m0s

running (0m20.0s), 5/5 VUs, 188 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m20.0s/4m0s

running (0m21.0s), 5/5 VUs, 198 complete and 0 interrupted iterations
constant_load   [   9% ] 5 VUs  0m21.0s/4m0s

running (0m22.0s), 5/5 VUs, 208 complete and 0 interrupted iterations
constant_load   [   9% ] 5 VUs  0m22.0s/4m0s

running (0m23.0s), 5/5 VUs, 215 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m23.0s/4m0s

running (0m24.0s), 5/5 VUs, 225 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m24.0s/4m0s

running (0m25.0s), 5/5 VUs, 235 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m25.0s/4m0s

running (0m26.0s), 5/5 VUs, 245 complete and 0 interrupted iterations
constant_load   [  11% ] 5 VUs  0m26.0s/4m0s

running (0m27.0s), 5/5 VUs, 255 complete and 0 interrupted iterations
constant_load   [  11% ] 5 VUs  0m27.0s/4m0s

running (0m28.0s), 5/5 VUs, 265 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m28.0s/4m0s

running (0m29.0s), 5/5 VUs, 275 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m29.0s/4m0s

running (0m30.0s), 5/5 VUs, 284 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m30.0s/4m0s

running (0m31.0s), 5/5 VUs, 294 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m31.0s/4m0s

running (0m32.0s), 5/5 VUs, 301 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m32.0s/4m0s

running (0m33.0s), 5/5 VUs, 310 complete and 0 interrupted iterations
constant_load   [  14% ] 5 VUs  0m33.0s/4m0s

running (0m34.0s), 5/5 VUs, 318 complete and 0 interrupted iterations
constant_load   [  14% ] 5 VUs  0m34.0s/4m0s

running (0m35.0s), 5/5 VUs, 323 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m35.0s/4m0s

running (0m36.0s), 5/5 VUs, 333 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m36.0s/4m0s

running (0m37.0s), 5/5 VUs, 342 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m37.0s/4m0s

running (0m38.0s), 5/5 VUs, 348 complete and 0 interrupted iterations
constant_load   [  16% ] 5 VUs  0m38.0s/4m0s

running (0m39.0s), 5/5 VUs, 358 complete and 0 interrupted iterations
constant_load   [  16% ] 5 VUs  0m39.0s/4m0s

running (0m40.0s), 5/5 VUs, 365 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m40.0s/4m0s

running (0m41.0s), 5/5 VUs, 373 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m41.0s/4m0s

running (0m42.0s), 5/5 VUs, 382 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m42.0s/4m0s

running (0m43.0s), 5/5 VUs, 385 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m43.0s/4m0s

running (0m44.0s), 5/5 VUs, 395 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m44.0s/4m0s

running (0m45.0s), 5/5 VUs, 400 complete and 0 interrupted iterations
constant_load   [  19% ] 5 VUs  0m45.0s/4m0s

running (0m46.0s), 5/5 VUs, 410 complete and 0 interrupted iterations
constant_load   [  19% ] 5 VUs  0m46.0s/4m0s

running (0m47.0s), 5/5 VUs, 417 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m47.0s/4m0s

running (0m48.0s), 5/5 VUs, 426 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m48.0s/4m0s

running (0m49.0s), 5/5 VUs, 435 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m49.0s/4m0s

running (0m50.0s), 5/5 VUs, 442 complete and 0 interrupted iterations
constant_load   [  21% ] 5 VUs  0m50.0s/4m0s

running (0m51.0s), 5/5 VUs, 448 complete and 0 interrupted iterations
constant_load   [  21% ] 5 VUs  0m51.0s/4m0s

running (0m52.0s), 5/5 VUs, 458 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m52.0s/4m0s

running (0m53.0s), 5/5 VUs, 463 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m53.0s/4m0s

running (0m54.0s), 5/5 VUs, 473 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m54.0s/4m0s

running (0m55.0s), 5/5 VUs, 480 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m55.0s/4m0s

running (0m56.0s), 5/5 VUs, 488 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m56.0s/4m0s

running (0m57.0s), 5/5 VUs, 495 complete and 0 interrupted iterations
constant_load   [  24% ] 5 VUs  0m57.0s/4m0s

running (0m58.0s), 5/5 VUs, 503 complete and 0 interrupted iterations
constant_load   [  24% ] 5 VUs  0m58.0s/4m0s

running (0m59.0s), 5/5 VUs, 510 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  0m59.0s/4m0s

running (1m00.0s), 5/5 VUs, 520 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  1m00.0s/4m0s

running (1m01.0s), 5/5 VUs, 528 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  1m01.0s/4m0s

running (1m02.0s), 5/5 VUs, 537 complete and 0 interrupted iterations
constant_load   [  26% ] 5 VUs  1m02.0s/4m0s

running (1m03.0s), 5/5 VUs, 545 complete and 0 interrupted iterations
constant_load   [  26% ] 5 VUs  1m03.0s/4m0s

running (1m04.0s), 5/5 VUs, 553 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m04.0s/4m0s

running (1m05.0s), 5/5 VUs, 562 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m05.0s/4m0s

running (1m06.0s), 5/5 VUs, 568 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  1m06.0s/4m0s

running (1m07.0s), 5/5 VUs, 578 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  1m07.0s/4m0s

running (1m08.0s), 5/5 VUs, 587 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  1m08.0s/4m0s

running (1m09.0s), 5/5 VUs, 595 complete and 0 interrupted iterations
constant_load   [  29% ] 5 VUs  1m09.0s/4m0s

running (1m10.0s), 5/5 VUs, 604 complete and 0 interrupted iterations
constant_load   [  29% ] 5 VUs  1m10.0s/4m0s

running (1m11.0s), 5/5 VUs, 610 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m11.0s/4m0s

running (1m12.0s), 5/5 VUs, 619 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m12.0s/4m0s

running (1m13.0s), 5/5 VUs, 627 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  1m13.0s/4m0s

running (1m14.0s), 5/5 VUs, 635 complete and 0 interrupted iterations
constant_load   [  31% ] 5 VUs  1m14.0s/4m0s

running (1m15.0s), 5/5 VUs, 644 complete and 0 interrupted iterations
constant_load   [  31% ] 5 VUs  1m15.0s/4m0s

running (1m16.0s), 5/5 VUs, 651 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m16.0s/4m0s

running (1m17.0s), 5/5 VUs, 660 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m17.0s/4m0s

running (1m18.0s), 5/5 VUs, 667 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  1m18.0s/4m0s

running (1m19.0s), 5/5 VUs, 676 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  1m19.0s/4m0s

running (1m20.0s), 5/5 VUs, 683 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  1m20.0s/4m0s

running (1m21.0s), 5/5 VUs, 689 complete and 0 interrupted iterations
constant_load   [  34% ] 5 VUs  1m21.0s/4m0s

running (1m22.0s), 5/5 VUs, 694 complete and 0 interrupted iterations
constant_load   [  34% ] 5 VUs  1m22.0s/4m0s

running (1m23.0s), 5/5 VUs, 704 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m23.0s/4m0s

running (1m24.0s), 5/5 VUs, 709 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m24.0s/4m0s

running (1m25.0s), 5/5 VUs, 719 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  1m25.0s/4m0s

running (1m26.0s), 5/5 VUs, 726 complete and 0 interrupted iterations
constant_load   [  36% ] 5 VUs  1m26.0s/4m0s

running (1m27.0s), 5/5 VUs, 734 complete and 0 interrupted iterations
constant_load   [  36% ] 5 VUs  1m27.0s/4m0s

running (1m28.0s), 5/5 VUs, 739 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m28.0s/4m0s

running (1m29.0s), 5/5 VUs, 749 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m29.0s/4m0s

running (1m30.0s), 5/5 VUs, 754 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  1m30.0s/4m0s

running (1m31.0s), 5/5 VUs, 764 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  1m31.0s/4m0s

running (1m32.0s), 5/5 VUs, 772 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  1m32.0s/4m0s

running (1m33.0s), 5/5 VUs, 779 complete and 0 interrupted iterations
constant_load   [  39% ] 5 VUs  1m33.0s/4m0s

running (1m34.0s), 5/5 VUs, 785 complete and 0 interrupted iterations
constant_load   [  39% ] 5 VUs  1m34.0s/4m0s

running (1m35.0s), 5/5 VUs, 792 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m35.0s/4m0s

running (1m36.0s), 5/5 VUs, 802 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m36.0s/4m0s

running (1m37.0s), 5/5 VUs, 810 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  1m37.0s/4m0s

running (1m38.0s), 5/5 VUs, 818 complete and 0 interrupted iterations
constant_load   [  41% ] 5 VUs  1m38.0s/4m0s

running (1m39.0s), 5/5 VUs, 825 complete and 0 interrupted iterations
constant_load   [  41% ] 5 VUs  1m39.0s/4m0s

running (1m40.0s), 5/5 VUs, 835 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  1m40.0s/4m0s

running (1m41.0s), 5/5 VUs, 841 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  1m41.0s/4m0s

running (1m42.0s), 5/5 VUs, 851 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  1m42.0s/4m0s

running (1m43.0s), 5/5 VUs, 861 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  1m43.0s/4m0s

running (1m44.0s), 5/5 VUs, 868 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  1m44.0s/4m0s

running (1m45.0s), 5/5 VUs, 876 complete and 0 interrupted iterations
constant_load   [  44% ] 5 VUs  1m45.0s/4m0s

running (1m46.0s), 5/5 VUs, 884 complete and 0 interrupted iterations
constant_load   [  44% ] 5 VUs  1m46.0s/4m0s

running (1m47.0s), 5/5 VUs, 891 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m47.0s/4m0s

running (1m48.0s), 5/5 VUs, 899 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m48.0s/4m0s

running (1m49.0s), 5/5 VUs, 907 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  1m49.0s/4m0s

running (1m50.0s), 5/5 VUs, 916 complete and 0 interrupted iterations
constant_load   [  46% ] 5 VUs  1m50.0s/4m0s

running (1m51.0s), 5/5 VUs, 921 complete and 0 interrupted iterations
constant_load   [  46% ] 5 VUs  1m51.0s/4m0s

running (1m52.0s), 5/5 VUs, 931 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m52.0s/4m0s

running (1m53.0s), 5/5 VUs, 936 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m53.0s/4m0s

running (1m54.0s), 5/5 VUs, 946 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  1m54.0s/4m0s

running (1m55.0s), 5/5 VUs, 953 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  1m55.0s/4m0s

running (1m56.0s), 5/5 VUs, 961 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  1m56.0s/4m0s

running (1m57.0s), 5/5 VUs, 967 complete and 0 interrupted iterations
constant_load   [  49% ] 5 VUs  1m57.0s/4m0s

running (1m58.0s), 5/5 VUs, 972 complete and 0 interrupted iterations
constant_load   [  49% ] 5 VUs  1m58.0s/4m0s

running (1m59.0s), 5/5 VUs, 982 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  1m59.0s/4m0s

running (2m00.0s), 5/5 VUs, 990 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  2m00.0s/4m0s

running (2m01.0s), 5/5 VUs, 998 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  2m01.0s/4m0s

running (2m02.0s), 5/5 VUs, 1007 complete and 0 interrupted iterations
constant_load   [  51% ] 5 VUs  2m02.0s/4m0s

running (2m03.0s), 5/5 VUs, 1013 complete and 0 interrupted iterations
constant_load   [  51% ] 5 VUs  2m03.0s/4m0s

running (2m04.0s), 5/5 VUs, 1022 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m04.0s/4m0s

running (2m05.0s), 5/5 VUs, 1032 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m05.0s/4m0s

running (2m06.0s), 5/5 VUs, 1037 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  2m06.0s/4m0s

running (2m07.0s), 5/5 VUs, 1047 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  2m07.0s/4m0s

running (2m08.0s), 5/5 VUs, 1052 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  2m08.0s/4m0s

running (2m09.0s), 5/5 VUs, 1062 complete and 0 interrupted iterations
constant_load   [  54% ] 5 VUs  2m09.0s/4m0s

running (2m10.0s), 5/5 VUs, 1070 complete and 0 interrupted iterations
constant_load   [  54% ] 5 VUs  2m10.0s/4m0s

running (2m11.0s), 5/5 VUs, 1078 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m11.0s/4m0s

running (2m12.0s), 5/5 VUs, 1086 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m12.0s/4m0s

running (2m13.0s), 5/5 VUs, 1092 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  2m13.0s/4m0s

running (2m14.0s), 5/5 VUs, 1100 complete and 0 interrupted iterations
constant_load   [  56% ] 5 VUs  2m14.0s/4m0s

running (2m15.0s), 5/5 VUs, 1108 complete and 0 interrupted iterations
constant_load   [  56% ] 5 VUs  2m15.0s/4m0s

running (2m16.0s), 5/5 VUs, 1117 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m16.0s/4m0s

running (2m17.0s), 5/5 VUs, 1125 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m17.0s/4m0s

running (2m18.0s), 5/5 VUs, 1133 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  2m18.0s/4m0s

running (2m19.0s), 5/5 VUs, 1140 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  2m19.0s/4m0s

running (2m20.0s), 5/5 VUs, 1148 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  2m20.0s/4m0s

running (2m21.0s), 5/5 VUs, 1158 complete and 0 interrupted iterations
constant_load   [  59% ] 5 VUs  2m21.0s/4m0s

running (2m22.0s), 5/5 VUs, 1166 complete and 0 interrupted iterations
constant_load   [  59% ] 5 VUs  2m22.0s/4m0s

running (2m23.0s), 5/5 VUs, 1173 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m23.0s/4m0s

running (2m24.0s), 5/5 VUs, 1182 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m24.0s/4m0s

running (2m25.0s), 5/5 VUs, 1189 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  2m25.0s/4m0s

running (2m26.0s), 5/5 VUs, 1197 complete and 0 interrupted iterations
constant_load   [  61% ] 5 VUs  2m26.0s/4m0s

running (2m27.0s), 5/5 VUs, 1206 complete and 0 interrupted iterations
constant_load   [  61% ] 5 VUs  2m27.0s/4m0s

running (2m28.0s), 5/5 VUs, 1214 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m28.0s/4m0s

running (2m29.0s), 5/5 VUs, 1220 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m29.0s/4m0s

running (2m30.0s), 5/5 VUs, 1229 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  2m30.0s/4m0s

running (2m31.0s), 5/5 VUs, 1239 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  2m31.0s/4m0s

running (2m32.0s), 5/5 VUs, 1249 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  2m32.0s/4m0s

running (2m33.0s), 5/5 VUs, 1259 complete and 0 interrupted iterations
constant_load   [  64% ] 5 VUs  2m33.0s/4m0s

running (2m34.0s), 5/5 VUs, 1269 complete and 0 interrupted iterations
constant_load   [  64% ] 5 VUs  2m34.0s/4m0s

running (2m35.0s), 5/5 VUs, 1277 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m35.0s/4m0s

running (2m36.0s), 5/5 VUs, 1285 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m36.0s/4m0s

running (2m37.0s), 5/5 VUs, 1295 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  2m37.0s/4m0s

running (2m38.0s), 5/5 VUs, 1305 complete and 0 interrupted iterations
constant_load   [  66% ] 5 VUs  2m38.0s/4m0s

running (2m39.0s), 5/5 VUs, 1315 complete and 0 interrupted iterations
constant_load   [  66% ] 5 VUs  2m39.0s/4m0s

running (2m40.0s), 5/5 VUs, 1325 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m40.0s/4m0s

running (2m41.0s), 5/5 VUs, 1335 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m41.0s/4m0s

running (2m42.0s), 5/5 VUs, 1345 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  2m42.0s/4m0s

running (2m43.0s), 5/5 VUs, 1355 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  2m43.0s/4m0s

running (2m44.0s), 5/5 VUs, 1364 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  2m44.0s/4m0s

running (2m45.0s), 5/5 VUs, 1374 complete and 0 interrupted iterations
constant_load   [  69% ] 5 VUs  2m45.0s/4m0s

running (2m46.0s), 5/5 VUs, 1382 complete and 0 interrupted iterations
constant_load   [  69% ] 5 VUs  2m46.0s/4m0s

running (2m47.0s), 5/5 VUs, 1392 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m47.0s/4m0s

running (2m48.0s), 5/5 VUs, 1402 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m48.0s/4m0s

running (2m49.0s), 5/5 VUs, 1412 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  2m49.0s/4m0s

running (2m50.0s), 5/5 VUs, 1420 complete and 0 interrupted iterations
constant_load   [  71% ] 5 VUs  2m50.0s/4m0s

running (2m51.0s), 5/5 VUs, 1430 complete and 0 interrupted iterations
constant_load   [  71% ] 5 VUs  2m51.0s/4m0s

running (2m52.0s), 5/5 VUs, 1440 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m52.0s/4m0s

running (2m53.0s), 5/5 VUs, 1450 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m53.0s/4m0s

running (2m54.0s), 5/5 VUs, 1460 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  2m54.0s/4m0s

running (2m55.0s), 5/5 VUs, 1470 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  2m55.0s/4m0s

running (2m56.0s), 5/5 VUs, 1480 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  2m56.0s/4m0s

running (2m57.0s), 5/5 VUs, 1490 complete and 0 interrupted iterations
constant_load   [  74% ] 5 VUs  2m57.0s/4m0s

running (2m58.0s), 5/5 VUs, 1498 complete and 0 interrupted iterations
constant_load   [  74% ] 5 VUs  2m58.0s/4m0s

running (2m59.0s), 5/5 VUs, 1508 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  2m59.0s/4m0s

running (3m00.0s), 5/5 VUs, 1515 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  3m00.0s/4m0s

running (3m01.0s), 5/5 VUs, 1525 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  3m01.0s/4m0s

running (3m02.0s), 5/5 VUs, 1535 complete and 0 interrupted iterations
constant_load   [  76% ] 5 VUs  3m02.0s/4m0s

running (3m03.0s), 5/5 VUs, 1545 complete and 0 interrupted iterations
constant_load   [  76% ] 5 VUs  3m03.0s/4m0s

running (3m04.0s), 5/5 VUs, 1555 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m04.0s/4m0s

running (3m05.0s), 5/5 VUs, 1565 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m05.0s/4m0s

running (3m06.0s), 5/5 VUs, 1575 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  3m06.0s/4m0s

running (3m07.0s), 5/5 VUs, 1585 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  3m07.0s/4m0s

running (3m08.0s), 5/5 VUs, 1593 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  3m08.0s/4m0s

running (3m09.0s), 5/5 VUs, 1603 complete and 0 interrupted iterations
constant_load   [  79% ] 5 VUs  3m09.0s/4m0s

running (3m10.0s), 5/5 VUs, 1613 complete and 0 interrupted iterations
constant_load   [  79% ] 5 VUs  3m10.0s/4m0s

running (3m11.0s), 5/5 VUs, 1621 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m11.0s/4m0s

running (3m12.0s), 5/5 VUs, 1631 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m12.0s/4m0s

running (3m13.0s), 5/5 VUs, 1641 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  3m13.0s/4m0s

running (3m14.0s), 5/5 VUs, 1650 complete and 0 interrupted iterations
constant_load   [  81% ] 5 VUs  3m14.0s/4m0s

running (3m15.0s), 5/5 VUs, 1660 complete and 0 interrupted iterations
constant_load   [  81% ] 5 VUs  3m15.0s/4m0s

running (3m16.0s), 5/5 VUs, 1670 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m16.0s/4m0s

running (3m17.0s), 5/5 VUs, 1680 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m17.0s/4m0s

running (3m18.0s), 5/5 VUs, 1690 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  3m18.0s/4m0s

running (3m19.0s), 5/5 VUs, 1700 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  3m19.0s/4m0s

running (3m20.0s), 5/5 VUs, 1710 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  3m20.0s/4m0s

running (3m21.0s), 5/5 VUs, 1719 complete and 0 interrupted iterations
constant_load   [  84% ] 5 VUs  3m21.0s/4m0s

running (3m22.0s), 5/5 VUs, 1727 complete and 0 interrupted iterations
constant_load   [  84% ] 5 VUs  3m22.0s/4m0s

running (3m23.0s), 5/5 VUs, 1737 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m23.0s/4m0s

running (3m24.0s), 5/5 VUs, 1747 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m24.0s/4m0s

running (3m25.0s), 5/5 VUs, 1756 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  3m25.0s/4m0s

running (3m26.0s), 5/5 VUs, 1766 complete and 0 interrupted iterations
constant_load   [  86% ] 5 VUs  3m26.0s/4m0s

running (3m27.0s), 5/5 VUs, 1776 complete and 0 interrupted iterations
constant_load   [  86% ] 5 VUs  3m27.0s/4m0s

running (3m28.0s), 5/5 VUs, 1786 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m28.0s/4m0s

running (3m29.0s), 5/5 VUs, 1795 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m29.0s/4m0s

running (3m30.0s), 5/5 VUs, 1805 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  3m30.0s/4m0s

running (3m31.0s), 5/5 VUs, 1815 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  3m31.0s/4m0s

running (3m32.0s), 5/5 VUs, 1825 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  3m32.0s/4m0s

running (3m33.0s), 5/5 VUs, 1834 complete and 0 interrupted iterations
constant_load   [  89% ] 5 VUs  3m33.0s/4m0s

running (3m34.0s), 5/5 VUs, 1844 complete and 0 interrupted iterations
constant_load   [  89% ] 5 VUs  3m34.0s/4m0s

running (3m35.0s), 5/5 VUs, 1853 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m35.0s/4m0s

running (3m36.0s), 5/5 VUs, 1863 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m36.0s/4m0s

running (3m37.0s), 5/5 VUs, 1873 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  3m37.0s/4m0s

running (3m38.0s), 5/5 VUs, 1883 complete and 0 interrupted iterations
constant_load   [  91% ] 5 VUs  3m38.0s/4m0s

running (3m39.0s), 5/5 VUs, 1891 complete and 0 interrupted iterations
constant_load   [  91% ] 5 VUs  3m39.0s/4m0s

running (3m40.0s), 5/5 VUs, 1900 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m40.0s/4m0s

running (3m41.0s), 5/5 VUs, 1910 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m41.0s/4m0s

running (3m42.0s), 5/5 VUs, 1920 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  3m42.0s/4m0s

running (3m43.0s), 5/5 VUs, 1930 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  3m43.0s/4m0s

running (3m44.0s), 5/5 VUs, 1940 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  3m44.0s/4m0s

running (3m45.0s), 5/5 VUs, 1950 complete and 0 interrupted iterations
constant_load   [  94% ] 5 VUs  3m45.0s/4m0s

running (3m46.0s), 5/5 VUs, 1960 complete and 0 interrupted iterations
constant_load   [  94% ] 5 VUs  3m46.0s/4m0s

running (3m47.0s), 5/5 VUs, 1970 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m47.0s/4m0s

running (3m48.0s), 5/5 VUs, 1980 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m48.0s/4m0s

running (3m49.0s), 5/5 VUs, 1990 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  3m49.0s/4m0s

running (3m50.0s), 5/5 VUs, 2000 complete and 0 interrupted iterations
constant_load   [  96% ] 5 VUs  3m50.0s/4m0s

running (3m51.0s), 5/5 VUs, 2009 complete and 0 interrupted iterations
constant_load   [  96% ] 5 VUs  3m51.0s/4m0s

running (3m52.0s), 5/5 VUs, 2016 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m52.0s/4m0s

running (3m53.0s), 5/5 VUs, 2026 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m53.0s/4m0s

running (3m54.0s), 5/5 VUs, 2035 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  3m54.0s/4m0s

running (3m55.0s), 5/5 VUs, 2045 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  3m55.0s/4m0s

running (3m56.0s), 5/5 VUs, 2055 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  3m56.0s/4m0s

running (3m57.0s), 5/5 VUs, 2065 complete and 0 interrupted iterations
constant_load   [  99% ] 5 VUs  3m57.0s/4m0s

running (3m58.0s), 5/5 VUs, 2075 complete and 0 interrupted iterations
constant_load   [  99% ] 5 VUs  3m58.0s/4m0s

running (3m59.0s), 5/5 VUs, 2085 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  3m59.0s/4m0s

running (4m00.0s), 5/5 VUs, 2095 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  4m00.0s/4m0s


  █ TOTAL RESULTS 

    checks_total.......: 2100    8.733339/s
    checks_succeeded...: 100.00% 2100 out of 2100
    checks_failed......: 0.00%   0 out of 2100

    ✓ list status is not 5xx
    ✓ create status is not 5xx
    ✓ get status is not 5xx

    HTTP
    http_req_duration..............: avg=71.41ms  min=3.08ms   med=24.59ms  max=801.53ms p(90)=128.06ms p(95)=202.53ms
      { expected_response:true }...: avg=71.41ms  min=3.08ms   med=24.59ms  max=801.53ms p(90)=128.06ms p(95)=202.53ms
    http_req_failed................: 0.00%  0 out of 2100
    http_reqs......................: 2100   8.733339/s

    EXECUTION
    iteration_duration.............: avg=572.23ms min=503.34ms med=525.62ms max=1.3s     p(90)=628.96ms p(95)=703.08ms
    iterations.....................: 2100   8.733339/s
    vus............................: 5      min=5         max=5
    vus_max........................: 5      min=5         max=5

    NETWORK
    data_received..................: 27 MB  113 kB/s
    data_sent......................: 186 kB 773 B/s



running (4m00.5s), 0/5 VUs, 2100 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 5 VUs  4m0s